hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fdcan.h
/*
; stm32N657_fdcan.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		stm32N657_fdcan equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

// FDCAN address definitions
// -------------------------

typedef struct {
		union {
	volatile	uint32_t	CREL;
	volatile	uint32_t	CCU_CREL;
		};
		union {
	volatile	uint32_t	ENDN;
	volatile	uint32_t	CCU_CCFG;
		};
	volatile	uint32_t	CCU_CSTAT;
		union {
	volatile	uint32_t	DBTP;
	volatile	uint32_t	CCU_CWD;
		};
		union {
	volatile	uint32_t	TEST;
	volatile	uint32_t	CCU_IR;
		};
		union {
	volatile	uint32_t	RWD;
	volatile	uint32_t	CCU_IE;
		};
	volatile	uint32_t	CCCR;
	volatile	uint32_t	NBTP;
	volatile	uint32_t	TSCC;
	volatile	uint32_t	TSCV;
	volatile	uint32_t	TOCC;
	volatile	uint32_t	TOCV;
	volatile	uint32_t	RESERVED0[4];
	volatile	uint32_t	ECR;
	volatile	uint32_t	PSR;
	volatile	uint32_t	TDCR;
	volatile	uint32_t	RESERVED1;
	volatile	uint32_t	IR;
	volatile	uint32_t	IE;
	volatile	uint32_t	ILS;
	volatile	uint32_t	ILE;
	volatile	uint32_t	RESERVED2[8];
	volatile	uint32_t	GFC;
	volatile	uint32_t	SIDFC;
	volatile	uint32_t	XIDFC;
	volatile	uint32_t	RESERVED3;
	volatile	uint32_t	XIDAM;
	volatile	uint32_t	HPMS;
	volatile	uint32_t	NDAT1;
	volatile	uint32_t	NDAT2;
	volatile	uint32_t	RXF0C;
	volatile	uint32_t	RXF0S;
	volatile	uint32_t	RXF0A;
	volatile	uint32_t	RXBC;
	volatile	uint32_t	RXF1C;
	volatile	uint32_t	RXF1S;
	volatile	uint32_t	RXF1A;
	volatile	uint32_t	RXESC;
	volatile	uint32_t	TXBC;
	volatile	uint32_t	TXFQS;
	volatile	uint32_t	TXESC;
	volatile	uint32_t	TXBRP;
	volatile	uint32_t	TXBAR;
	volatile	uint32_t	TXBCR;
	volatile	uint32_t	TXBTO;
	volatile	uint32_t	TXBCF;
	volatile	uint32_t	TXBTIE;
	volatile	uint32_t	TXBCIE;
	volatile	uint32_t	RESERVED4[2];
	volatile	uint32_t	TXEFC;
	volatile	uint32_t	TXEFS;
	volatile	uint32_t	TXEFA;
	volatile	uint32_t	RESERVED5;
	volatile	uint32_t	TTTMC;
	volatile	uint32_t	TTRMC;
	volatile	uint32_t	TTOCF;
	volatile	uint32_t	TTMLM;
	volatile	uint32_t	TURCF;
	volatile	uint32_t	TTOCN;
	volatile	uint32_t	TTGTP;
	volatile	uint32_t	TTTMK;
	volatile	uint32_t	TTIR;
	volatile	uint32_t	TTIE;
	volatile	uint32_t	TTILS;
	volatile	uint32_t	TTOST;
	volatile	uint32_t	TURNA;
	volatile	uint32_t	TTLGT;
	volatile	uint32_t	TTCTC;
	volatile	uint32_t	TTCPT;
	volatile	uint32_t	TTCSM;
	volatile	uint32_t	RESERVED6[111];
	volatile	uint32_t	TTTS;
} FDCAN_TypeDef;

#if (defined(__cplusplus))
#define	FDCAN1_NS	reinterpret_cast<FDCAN_TypeDef *>(0x4000A000u)
#define	FDCAN1_S	reinterpret_cast<FDCAN_TypeDef *>(0x5000A000u)
#define	FDCAN2_NS	reinterpret_cast<FDCAN_TypeDef *>(0x4000A400u)
#define	FDCAN2_S	reinterpret_cast<FDCAN_TypeDef *>(0x5000A400u)
#define	FDCAN3_NS	reinterpret_cast<FDCAN_TypeDef *>(0x4000E800u)
#define	FDCAN3_S	reinterpret_cast<FDCAN_TypeDef *>(0x5000E800u)

#else
#define	FDCAN1_NS	((FDCAN_TypeDef *)0x4000A000u)
#define	FDCAN1_S	((FDCAN_TypeDef *)0x5000A000u)
#define	FDCAN2_NS	((FDCAN_TypeDef *)0x4000A400u)
#define	FDCAN2_S	((FDCAN_TypeDef *)0x5000A400u)
#define	FDCAN3_NS	((FDCAN_TypeDef *)0x4000E800u)
#define	FDCAN3_S	((FDCAN_TypeDef *)0x5000E800u)
#endif

// CREL Configuration

#define	FDCAN_CREL_REL					(0xFu<<28)
#define	FDCAN_CREL_REL_0				(0x1u<<28)
#define	FDCAN_CREL_STEP					(0xFu<<24)
#define	FDCAN_CREL_STEP_0				(0x1u<<24)
#define	FDCAN_CREL_SUBSTEP				(0xFu<<20)
#define	FDCAN_CREL_SUBSTEP_0			(0x1u<<20)
#define	FDCAN_CREL_YEAR					(0xFu<<16)
#define	FDCAN_CREL_YEAR_0				(0x1u<<16)
#define	FDCAN_CREL_MON					(0xFFu<<8)
#define	FDCAN_CREL_MON_0				(0x1u<<8)
#define	FDCAN_CREL_DAY					(0xFFu<<0)
#define	FDCAN_CREL_DAY_0				(0x1u<<0)

// CCU_CREL Configuration

#define	FDCAN_CCU_CREL_REL				(0xFu<<28)
#define	FDCAN_CCU_CREL_REL_0			(0x1u<<28)
#define	FDCAN_CCU_CREL_STEP				(0xFu<<24)
#define	FDCAN_CCU_CREL_STEP_0			(0x1u<<24)
#define	FDCAN_CCU_CREL_SUBSTEP			(0xFu<<20)
#define	FDCAN_CCU_CREL_SUBSTEP_0		(0x1u<<20)
#define	FDCAN_CCU_CREL_YEAR				(0xFu<<16)
#define	FDCAN_CCU_CREL_YEAR_0			(0x1u<<16)
#define	FDCAN_CCU_CREL_MON				(0xFFu<<8)
#define	FDCAN_CCU_CREL_MON_0			(0x1u<<8)
#define	FDCAN_CCU_CREL_DAY				(0xFFu<<0)
#define	FDCAN_CCU_CREL_DAY_0			(0x1u<<0)

// ENDN Configuration

#define	FDCAN_ENDN_ETV					(0xFFFFFFFFu<<0)
#define	FDCAN_ENDN_ETV_0				(0x1u<<0)

// CCU_CCFG Configuration

