hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fdcan.h
#define	FDCAN_CCU_CCFG_SWR				(0x1u<<31)
#define	FDCAN_CCU_CCFG_CDIV				(0xFu<<16)
#define	FDCAN_CCU_CCFG_CDIV_0			(0x1u<<16)
#define	FDCAN_CCU_CCFG_OCPM				(0xFFu<<8)
#define	FDCAN_CCU_CCFG_OCPM_0			(0x1u<<8)
#define	FDCAN_CCU_CCFG_CFL				(0x1u<<7)
#define	FDCAN_CCU_CCFG_BCC				(0x1u<<6)
#define	FDCAN_CCU_CCFG_TQBT				(0x1Fu<<0)
#define	FDCAN_CCU_CCFG_TQBT_0			(0x1u<<0)

#define	FDCAN_CCU_CCFG_CDIV_B_0X0		(0x0u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X1		(0x1u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X2		(0x2u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X3		(0x3u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X4		(0x4u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X5		(0x5u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X6		(0x6u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X7		(0x7u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X8		(0x8u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0X9		(0x9u<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0XA		(0xAu<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0XB		(0xBu<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0XC		(0xCu<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0XD		(0xDu<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0XE		(0xEu<<16)
#define	FDCAN_CCU_CCFG_CDIV_B_0XF		(0xFu<<16)
#define	FDCAN_CCU_CCFG_CFL_B_0X0		(0x0u<<7)
#define	FDCAN_CCU_CCFG_CFL_B_0X1		(0x1u<<7)
#define	FDCAN_CCU_CCFG_BCC_B_0X0		(0x0u<<6)
#define	FDCAN_CCU_CCFG_BCC_B_0X1		(0x1u<<6)

// CCU_CSTAT Configuration

#define	FDCAN_CCU_CSTAT_CALS			(0x3u<<30)
#define	FDCAN_CCU_CSTAT_CALS_0			(0x1u<<30)
#define	FDCAN_CCU_CSTAT_TQC				(0x7FFu<<18)
#define	FDCAN_CCU_CSTAT_TQC_0			(0x1u<<18)
#define	FDCAN_CCU_CSTAT_OCPC			(0x3FFFFu<<0)
#define	FDCAN_CCU_CSTAT_OCPC_0			(0x1u<<0)

#define	FDCAN_CCU_CSTAT_CALS_B_0X0		(0x0u<<30)
#define	FDCAN_CCU_CSTAT_CALS_B_0X1		(0x1u<<30)
#define	FDCAN_CCU_CSTAT_CALS_B_0X2		(0x2u<<30)

// DBTP Configuration

#define	FDCAN_DBTP_TDC					(0x1u<<23)
#define	FDCAN_DBTP_DBRP					(0x1Fu<<16)
#define	FDCAN_DBTP_DBRP_0				(0x1u<<16)
#define	FDCAN_DBTP_DTSEG1				(0x1Fu<<8)
#define	FDCAN_DBTP_DTSEG1_0				(0x1u<<8)
#define	FDCAN_DBTP_DTSEG2				(0xFu<<4)
#define	FDCAN_DBTP_DTSEG2_0				(0x1u<<4)
#define	FDCAN_DBTP_DSJW					(0xFu<<0)
#define	FDCAN_DBTP_DSJW_0				(0x1u<<0)

#define	FDCAN_DBTP_TDC_B_0X0			(0x0u<<23)
#define	FDCAN_DBTP_TDC_B_0X1			(0x1u<<23)

// CCU_CWD Configuration

#define	FDCAN_CCU_CWD_WDV				(0xFFFFu<<16)
#define	FDCAN_CCU_CWD_WDV_0				(0x1u<<16)
#define	FDCAN_CCU_CWD_WDC				(0xFFFFu<<0)
#define	FDCAN_CCU_CWD_WDC_0				(0x1u<<0)

// TEST Configuration

#define	FDCAN_TEST_RX					(0x1u<<7)
#define	FDCAN_TEST_TX					(0x3u<<5)
#define	FDCAN_TEST_TX_0					(0x1u<<5)
#define	FDCAN_TEST_LBCK					(0x1u<<4)

#define	FDCAN_TEST_RX_B_0X0				(0x0u<<7)
#define	FDCAN_TEST_RX_B_0X1				(0x1u<<7)
#define	FDCAN_TEST_TX_B_0X0				(0x0u<<5)
#define	FDCAN_TEST_TX_B_0X1				(0x1u<<5)
#define	FDCAN_TEST_TX_B_0X2				(0x2u<<5)
#define	FDCAN_TEST_TX_B_0X3				(0x3u<<5)
#define	FDCAN_TEST_LBCK_B_0X0			(0x0u<<4)
#define	FDCAN_TEST_LBCK_B_0X1			(0x1u<<4)

// CCU_IR Configuration

#define	FDCAN_CCU_IR_CSC				(0x1u<<1)
#define	FDCAN_CCU_IR_CWE				(0x1u<<0)

#define	FDCAN_CCU_IR_CSC_B_0X0			(0x0u<<1)
#define	FDCAN_CCU_IR_CSC_B_0X1			(0x1u<<1)
#define	FDCAN_CCU_IR_CWE_B_0X0			(0x0u<<0)
#define	FDCAN_CCU_IR_CWE_B_0X1			(0x1u<<0)

// RWD Configuration

#define	FDCAN_RWD_WDV					(0xFFu<<8)
#define	FDCAN_RWD_WDV_0					(0x1u<<8)
#define	FDCAN_RWD_WDC					(0xFFu<<0)
#define	FDCAN_RWD_WDC_0					(0x1u<<0)

// CCU_IE Configuration

#define	FDCAN_CCU_IE_CSCE				(0x1u<<1)
#define	FDCAN_CCU_IE_CWEE				(0x1u<<0)

#define	FDCAN_CCU_IE_CSCE_B_0X0			(0x0u<<1)
#define	FDCAN_CCU_IE_CSCE_B_0X1			(0x1u<<1)
#define	FDCAN_CCU_IE_CWEE_B_0X0			(0x0u<<0)
#define	FDCAN_CCU_IE_CWEE_B_0X1			(0x1u<<0)

// CCCR Configuration

#define	FDCAN_CCCR_NISO					(0x1u<<15)
#define	FDCAN_CCCR_TXP					(0x1u<<14)
#define	FDCAN_CCCR_EFBI					(0x1u<<13)
#define	FDCAN_CCCR_PXHD					(0x1u<<12)
#define	FDCAN_CCCR_BRSE					(0x1u<<9)
#define	FDCAN_CCCR_FDOE					(0x1u<<8)
#define	FDCAN_CCCR_TEST					(0x1u<<7)
#define	FDCAN_CCCR_DAR					(0x1u<<6)
#define	FDCAN_CCCR_MON					(0x1u<<5)
#define	FDCAN_CCCR_CSR					(0x1u<<4)
#define	FDCAN_CCCR_CSA					(0x1u<<3)
#define	FDCAN_CCCR_ASM					(0x1u<<2)
#define	FDCAN_CCCR_CCE					(0x1u<<1)
#define	FDCAN_CCCR_INIT					(0x1u<<0)

#define	FDCAN_CCCR_NISO_B_0X0			(0x0u<<15)
#define	FDCAN_CCCR_NISO_B_0X1			(0x1u<<15)
#define	FDCAN_CCCR_TXP_B_0X0			(0x0u<<14)
#define	FDCAN_CCCR_TXP_B_0X1			(0x1u<<14)
#define	FDCAN_CCCR_EFBI_B_0X0			(0x0u<<13)
#define	FDCAN_CCCR_EFBI_B_0X1			(0x1u<<13)
#define	FDCAN_CCCR_PXHD_B_0X0			(0x0u<<12)
#define	FDCAN_CCCR_PXHD_B_0X1			(0x1u<<12)
#define	FDCAN_CCCR_BRSE_B_0X0			(0x0u<<9)
#define	FDCAN_CCCR_BRSE_B_0X1			(0x1u<<9)
#define	FDCAN_CCCR_FDOE_B_0X0			(0x0u<<8)
#define	FDCAN_CCCR_FDOE_B_0X1			(0x1u<<8)
#define	FDCAN_CCCR_TEST_B_0X0			(0x0u<<7)
#define	FDCAN_CCCR_TEST_B_0X1			(0x1u<<7)
#define	FDCAN_CCCR_DAR_B_0X0			(0x0u<<6)
#define	FDCAN_CCCR_DAR_B_0X1			(0x1u<<6)
#define	FDCAN_CCCR_MON_B_0X0			(0x0u<<5)
#define	FDCAN_CCCR_MON_B_0X1			(0x1u<<5)
#define	FDCAN_CCCR_CSR_B_0X0			(0x0u<<4)
#define	FDCAN_CCCR_CSR_B_0X1			(0x1u<<4)
#define	FDCAN_CCCR_CSA_B_0X0			(0x0u<<3)
#define	FDCAN_CCCR_CSA_B_0X1			(0x1u<<3)
#define	FDCAN_CCCR_ASM_B_0X0			(0x0u<<2)
#define	FDCAN_CCCR_ASM_B_0X1			(0x1u<<2)
#define	FDCAN_CCCR_CCE_B_0X0			(0x0u<<1)
#define	FDCAN_CCCR_CCE_B_0X1			(0x1u<<1)
#define	FDCAN_CCCR_INIT_B_0X0			(0x0u<<0)
#define	FDCAN_CCCR_INIT_B_0X1			(0x1u<<0)

// NBTP Configuration

#define	FDCAN_NBTP_NSJW					(0x7Fu<<25)
#define	FDCAN_NBTP_NSJW_0				(0x1u<<25)
#define	FDCAN_NBTP_NBRP					(0x1FFu<<16)
#define	FDCAN_NBTP_NBRP_0				(0x1u<<16)
#define	FDCAN_NBTP_NTSEG1				(0xFFu<<8)
#define	FDCAN_NBTP_NTSEG1_0				(0x1u<<8)
#define	FDCAN_NBTP_NTSEG2				(0x7Fu<<0)
#define	FDCAN_NBTP_NTSEG2_0				(0x1u<<0)

// TSCC Configuration

#define	FDCAN_TSCC_TCP					(0xFu<<16)
#define	FDCAN_TSCC_TCP_0				(0x1u<<16)
#define	FDCAN_TSCC_TSS					(0x3u<<0)
#define	FDCAN_TSCC_TSS_0				(0x1u<<0)

#define	FDCAN_TSCC_TSS_B_0X0			(0x0u<<0)
#define	FDCAN_TSCC_TSS_B_0X1			(0x1u<<0)
#define	FDCAN_TSCC_TSS_B_0X2			(0x2u<<0)
#define	FDCAN_TSCC_TSS_B_0X3			(0x3u<<0)

