hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fdcan.h
// TSCV Configuration

#define	FDCAN_TSCV_TSC					(0xFFFFu<<0)
#define	FDCAN_TSCV_TSC_0				(0x1u<<0)

// TOCC Configuration

#define	FDCAN_TOCC_TOP					(0xFFFFu<<16)
#define	FDCAN_TOCC_TOP_0				(0x1u<<16)
#define	FDCAN_TOCC_TOS					(0x3u<<1)
#define	FDCAN_TOCC_TOS_0				(0x1u<<1)
#define	FDCAN_TOCC_ETOC					(0x1u<<0)

#define	FDCAN_TOCC_TOS_B_0X0			(0x0u<<1)
#define	FDCAN_TOCC_TOS_B_0X1			(0x1u<<1)
#define	FDCAN_TOCC_TOS_B_0X2			(0x2u<<1)
#define	FDCAN_TOCC_TOS_B_0X3			(0x3u<<1)
#define	FDCAN_TOCC_ETOC_B_0X0			(0x0u<<0)
#define	FDCAN_TOCC_ETOC_B_0X1			(0x1u<<0)

// TOCV Configuration

#define	FDCAN_TOCV_TOC					(0xFFFFu<<0)
#define	FDCAN_TOCV_TOC_0				(0x1u<<0)

// ECR Configuration

#define	FDCAN_ECR_CEL					(0xFFu<<16)
#define	FDCAN_ECR_CEL_0					(0x1u<<16)
#define	FDCAN_ECR_RP					(0x1u<<15)
#define	FDCAN_ECR_REC					(0x7Fu<<8)
#define	FDCAN_ECR_REC_0					(0x1u<<8)
#define	FDCAN_ECR_TEC					(0xFFu<<0)
#define	FDCAN_ECR_TEC_0					(0x1u<<0)

#define	FDCAN_ECR_RP_B_0X0				(0x0u<<15)
#define	FDCAN_ECR_RP_B_0X1				(0x1u<<15)

// PSR Configuration

#define	FDCAN_PSR_TDCV					(0x7Fu<<16)
#define	FDCAN_PSR_TDCV_0				(0x1u<<16)
#define	FDCAN_PSR_PXE					(0x1u<<14)
#define	FDCAN_PSR_REDL					(0x1u<<13)
#define	FDCAN_PSR_RBRS					(0x1u<<12)
#define	FDCAN_PSR_RESI					(0x1u<<11)
#define	FDCAN_PSR_DLEC					(0x7u<<8)
#define	FDCAN_PSR_DLEC_0				(0x1u<<8)
#define	FDCAN_PSR_BO					(0x1u<<7)
#define	FDCAN_PSR_EW					(0x1u<<6)
#define	FDCAN_PSR_EP					(0x1u<<5)
#define	FDCAN_PSR_ACT					(0x3u<<3)
#define	FDCAN_PSR_ACT_0					(0x1u<<3)
#define	FDCAN_PSR_LEC					(0x7u<<0)
#define	FDCAN_PSR_LEC_0					(0x1u<<0)

#define	FDCAN_PSR_PXE_B_0X0				(0x0u<<14)
#define	FDCAN_PSR_PXE_B_0X1				(0x1u<<14)
#define	FDCAN_PSR_REDL_B_0X0			(0x0u<<13)
#define	FDCAN_PSR_REDL_B_0X1			(0x1u<<13)
#define	FDCAN_PSR_RBRS_B_0X0			(0x0u<<12)
#define	FDCAN_PSR_RBRS_B_0X1			(0x1u<<12)
#define	FDCAN_PSR_RESI_B_0X0			(0x0u<<11)
#define	FDCAN_PSR_RESI_B_0X1			(0x1u<<11)
#define	FDCAN_PSR_BO_B_0X0				(0x0u<<7)
#define	FDCAN_PSR_BO_B_0X1				(0x1u<<7)
#define	FDCAN_PSR_EW_B_0X0				(0x0u<<6)
#define	FDCAN_PSR_EW_B_0X1				(0x1u<<6)
#define	FDCAN_PSR_EP_B_0X0				(0x0u<<5)
#define	FDCAN_PSR_EP_B_0X1				(0x1u<<5)
#define	FDCAN_PSR_ACT_B_0X0				(0x0u<<3)
#define	FDCAN_PSR_ACT_B_0X1				(0x1u<<3)
#define	FDCAN_PSR_ACT_B_0X2				(0x2u<<3)
#define	FDCAN_PSR_ACT_B_0X3				(0x3u<<3)
#define	FDCAN_PSR_LEC_B_0X0				(0x0u<<0)
#define	FDCAN_PSR_LEC_B_0X1				(0x1u<<0)
#define	FDCAN_PSR_LEC_B_0X2				(0x2u<<0)
#define	FDCAN_PSR_LEC_B_0X3				(0x3u<<0)
#define	FDCAN_PSR_LEC_B_0X4				(0x4u<<0)
#define	FDCAN_PSR_LEC_B_0X5				(0x5u<<0)
#define	FDCAN_PSR_LEC_B_0X6				(0x6u<<0)
#define	FDCAN_PSR_LEC_B_0X7				(0x7u<<0)

// TDCR Configuration

#define	FDCAN_TDCR_TDCO					(0x7Fu<<8)
#define	FDCAN_TDCR_TDCO_0				(0x1u<<8)
#define	FDCAN_TDCR_TDCF					(0x7Fu<<0)
#define	FDCAN_TDCR_TDCF_0				(0x1u<<0)

// IR Configuration

#define	FDCAN_IR_ARA					(0x1u<<29)
#define	FDCAN_IR_PED					(0x1u<<28)
#define	FDCAN_IR_PEA					(0x1u<<27)
#define	FDCAN_IR_WDI					(0x1u<<26)
#define	FDCAN_IR_BO						(0x1u<<25)
#define	FDCAN_IR_EW						(0x1u<<24)
#define	FDCAN_IR_EP						(0x1u<<23)
#define	FDCAN_IR_ELO					(0x1u<<22)
#define	FDCAN_IR_DRX					(0x1u<<19)
#define	FDCAN_IR_TOO					(0x1u<<18)
#define	FDCAN_IR_MRAF					(0x1u<<17)
#define	FDCAN_IR_TSW					(0x1u<<16)
#define	FDCAN_IR_TEFL					(0x1u<<15)
#define	FDCAN_IR_TEFF					(0x1u<<14)
#define	FDCAN_IR_TEFW					(0x1u<<13)
#define	FDCAN_IR_TEFN					(0x1u<<12)
#define	FDCAN_IR_TFE					(0x1u<<11)
#define	FDCAN_IR_TCF					(0x1u<<10)
#define	FDCAN_IR_TC						(0x1u<<9)
#define	FDCAN_IR_HPM					(0x1u<<8)
#define	FDCAN_IR_RF1L					(0x1u<<7)
#define	FDCAN_IR_RF1F					(0x1u<<6)
#define	FDCAN_IR_RF1W					(0x1u<<5)
#define	FDCAN_IR_RF1N					(0x1u<<4)
#define	FDCAN_IR_RF0L					(0x1u<<3)
#define	FDCAN_IR_RF0F					(0x1u<<2)
#define	FDCAN_IR_RF0W					(0x1u<<1)
#define	FDCAN_IR_RF0N					(0x1u<<0)

#define	FDCAN_IR_ARA_B_0X0				(0x0u<<29)
#define	FDCAN_IR_ARA_B_0X1				(0x1u<<29)
#define	FDCAN_IR_PED_B_0X0				(0x0u<<28)
#define	FDCAN_IR_PED_B_0X1				(0x1u<<28)
#define	FDCAN_IR_PEA_B_0X0				(0x0u<<27)
#define	FDCAN_IR_PEA_B_0X1				(0x1u<<27)
#define	FDCAN_IR_WDI_B_0X0				(0x0u<<26)
#define	FDCAN_IR_WDI_B_0X1				(0x1u<<26)
#define	FDCAN_IR_BO_B_0X0				(0x0u<<25)
#define	FDCAN_IR_BO_B_0X1				(0x1u<<25)
#define	FDCAN_IR_EW_B_0X0				(0x0u<<24)
#define	FDCAN_IR_EW_B_0X1				(0x1u<<24)
#define	FDCAN_IR_EP_B_0X0				(0x0u<<23)
#define	FDCAN_IR_EP_B_0X1				(0x1u<<23)
#define	FDCAN_IR_ELO_B_0X0				(0x0u<<22)
#define	FDCAN_IR_ELO_B_0X1				(0x1u<<22)
#define	FDCAN_IR_DRX_B_0X0				(0x0u<<19)
#define	FDCAN_IR_DRX_B_0X1				(0x1u<<19)
#define	FDCAN_IR_TOO_B_0X0				(0x0u<<18)
#define	FDCAN_IR_TOO_B_0X1				(0x1u<<18)
#define	FDCAN_IR_MRAF_B_0X0				(0x0u<<17)
#define	FDCAN_IR_MRAF_B_0X1				(0x1u<<17)
#define	FDCAN_IR_TSW_B_0X0				(0x0u<<16)
#define	FDCAN_IR_TSW_B_0X1				(0x1u<<16)
#define	FDCAN_IR_TEFL_B_0X0				(0x0u<<15)
#define	FDCAN_IR_TEFL_B_0X1				(0x1u<<15)
#define	FDCAN_IR_TEFF_B_0X0				(0x0u<<14)
#define	FDCAN_IR_TEFF_B_0X1				(0x1u<<14)
#define	FDCAN_IR_TEFW_B_0X0				(0x0u<<13)
#define	FDCAN_IR_TEFW_B_0X1				(0x1u<<13)
#define	FDCAN_IR_TEFN_B_0X0				(0x0u<<12)
#define	FDCAN_IR_TEFN_B_0X1				(0x1u<<12)
#define	FDCAN_IR_TFE_B_0X0				(0x0u<<11)
#define	FDCAN_IR_TFE_B_0X1				(0x1u<<11)
#define	FDCAN_IR_TCF_B_0X0				(0x0u<<10)
#define	FDCAN_IR_TCF_B_0X1				(0x1u<<10)
#define	FDCAN_IR_TC_B_0X0				(0x0u<<9)
#define	FDCAN_IR_TC_B_0X1				(0x1u<<9)
#define	FDCAN_IR_HPM_B_0X0				(0x0u<<8)
#define	FDCAN_IR_HPM_B_0X1				(0x1u<<8)
#define	FDCAN_IR_RF1L_B_0X0				(0x0u<<7)
#define	FDCAN_IR_RF1L_B_0X1				(0x1u<<7)
#define	FDCAN_IR_RF1F_B_0X0				(0x0u<<6)
#define	FDCAN_IR_RF1F_B_0X1				(0x1u<<6)
#define	FDCAN_IR_RF1W_B_0X0				(0x0u<<5)
#define	FDCAN_IR_RF1W_B_0X1				(0x1u<<5)
#define	FDCAN_IR_RF1N_B_0X0				(0x0u<<4)
#define	FDCAN_IR_RF1N_B_0X1				(0x1u<<4)
#define	FDCAN_IR_RF0L_B_0X0				(0x0u<<3)
#define	FDCAN_IR_RF0L_B_0X1				(0x1u<<3)
#define	FDCAN_IR_RF0F_B_0X0				(0x0u<<2)
#define	FDCAN_IR_RF0F_B_0X1				(0x1u<<2)
#define	FDCAN_IR_RF0W_B_0X0				(0x0u<<1)
#define	FDCAN_IR_RF0W_B_0X1				(0x1u<<1)
#define	FDCAN_IR_RF0N_B_0X0				(0x0u<<0)
#define	FDCAN_IR_RF0N_B_0X1				(0x1u<<0)

// IE Configuration

#define	FDCAN_IE_ARAE					(0x1u<<29)
#define	FDCAN_IE_PEDE					(0x1u<<28)
#define	FDCAN_IE_PEAE					(0x1u<<27)
#define	FDCAN_IE_WDIE					(0x1u<<26)
#define	FDCAN_IE_BOE					(0x1u<<25)
#define	FDCAN_IE_EWE					(0x1u<<24)
#define	FDCAN_IE_EPE					(0x1u<<23)
#define	FDCAN_IE_ELOE					(0x1u<<22)
#define	FDCAN_IE_DRXE					(0x1u<<19)
#define	FDCAN_IE_TOOE					(0x1u<<18)
#define	FDCAN_IE_MRAFE					(0x1u<<17)
#define	FDCAN_IE_TSWE					(0x1u<<16)
#define	FDCAN_IE_TEFLE					(0x1u<<15)
#define	FDCAN_IE_TEFFE					(0x1u<<14)
#define	FDCAN_IE_TEFWE					(0x1u<<13)
#define	FDCAN_IE_TEFNE					(0x1u<<12)
#define	FDCAN_IE_TFEE					(0x1u<<11)
#define	FDCAN_IE_TCFE					(0x1u<<10)
#define	FDCAN_IE_TCE					(0x1u<<9)
#define	FDCAN_IE_HPME					(0x1u<<8)
#define	FDCAN_IE_RF1LE					(0x1u<<7)
#define	FDCAN_IE_RF1FE					(0x1u<<6)
#define	FDCAN_IE_RF1WE					(0x1u<<5)
#define	FDCAN_IE_RF1NE					(0x1u<<4)
#define	FDCAN_IE_RF0LE					(0x1u<<3)
#define	FDCAN_IE_RF0FE					(0x1u<<2)
#define	FDCAN_IE_RF0WE					(0x1u<<1)
#define	FDCAN_IE_RF0NE					(0x1u<<0)

#define	FDCAN_IE_WDIE_B_0X0				(0x0u<<26)
#define	FDCAN_IE_WDIE_B_0X1				(0x1u<<26)
#define	FDCAN_IE_BOE_B_0X0				(0x0u<<25)
#define	FDCAN_IE_BOE_B_0X1				(0x1u<<25)
#define	FDCAN_IE_EWE_B_0X0				(0x0u<<24)
#define	FDCAN_IE_EWE_B_0X1				(0x1u<<24)
#define	FDCAN_IE_EPE_B_0X0				(0x0u<<23)
#define	FDCAN_IE_EPE_B_0X1				(0x1u<<23)
#define	FDCAN_IE_ELOE_B_0X0				(0x0u<<22)
#define	FDCAN_IE_ELOE_B_0X1				(0x1u<<22)
#define	FDCAN_IE_DRXE_B_0X0				(0x0u<<19)
#define	FDCAN_IE_DRXE_B_0X1				(0x1u<<19)
#define	FDCAN_IE_TOOE_B_0X0				(0x0u<<18)
#define	FDCAN_IE_TOOE_B_0X1				(0x1u<<18)
#define	FDCAN_IE_MRAFE_B_0X0			(0x0u<<17)
#define	FDCAN_IE_MRAFE_B_0X1			(0x1u<<17)
#define	FDCAN_IE_TSWE_B_0X0				(0x0u<<16)
#define	FDCAN_IE_TSWE_B_0X1				(0x1u<<16)
#define	FDCAN_IE_TEFLE_B_0X0			(0x0u<<15)
#define	FDCAN_IE_TEFLE_B_0X1			(0x1u<<15)
#define	FDCAN_IE_TEFFE_B_0X0			(0x0u<<14)
#define	FDCAN_IE_TEFFE_B_0X1			(0x1u<<14)
#define	FDCAN_IE_TEFWE_B_0X0			(0x0u<<13)
#define	FDCAN_IE_TEFWE_B_0X1			(0x1u<<13)
#define	FDCAN_IE_TEFNE_B_0X0			(0x0u<<12)
#define	FDCAN_IE_TEFNE_B_0X1			(0x1u<<12)
#define	FDCAN_IE_TFEE_B_0X0				(0x0u<<11)
#define	FDCAN_IE_TFEE_B_0X1				(0x1u<<11)
#define	FDCAN_IE_TCFE_B_0X0				(0x0u<<10)
#define	FDCAN_IE_TCFE_B_0X1				(0x1u<<10)
#define	FDCAN_IE_TCE_B_0X0				(0x0u<<9)
#define	FDCAN_IE_TCE_B_0X1				(0x1u<<9)
#define	FDCAN_IE_HPME_B_0X0				(0x0u<<8)
#define	FDCAN_IE_HPME_B_0X1				(0x1u<<8)
#define	FDCAN_IE_RF1LE_B_0X0			(0x0u<<7)
#define	FDCAN_IE_RF1LE_B_0X1			(0x1u<<7)
#define	FDCAN_IE_RF1FE_B_0X0			(0x0u<<6)
#define	FDCAN_IE_RF1FE_B_0X1			(0x1u<<6)
#define	FDCAN_IE_RF1WE_B_0X0			(0x0u<<5)
#define	FDCAN_IE_RF1WE_B_0X1			(0x1u<<5)
#define	FDCAN_IE_RF1NE_B_0X0			(0x0u<<4)
#define	FDCAN_IE_RF1NE_B_0X1			(0x1u<<4)
#define	FDCAN_IE_RF0LE_B_0X0			(0x0u<<3)
#define	FDCAN_IE_RF0LE_B_0X1			(0x1u<<3)
#define	FDCAN_IE_RF0FE_B_0X0			(0x0u<<2)
#define	FDCAN_IE_RF0FE_B_0X1			(0x1u<<2)
#define	FDCAN_IE_RF0WE_B_0X0			(0x0u<<1)
#define	FDCAN_IE_RF0WE_B_0X1			(0x1u<<1)
#define	FDCAN_IE_RF0NE_B_0X0			(0x0u<<0)
#define	FDCAN_IE_RF0NE_B_0X1			(0x1u<<0)

// ILS Configuration

#define	FDCAN_ILS_ARAL					(0x1u<<29)
#define	FDCAN_ILS_PEDL					(0x1u<<28)
#define	FDCAN_ILS_PEAL					(0x1u<<27)
#define	FDCAN_ILS_WDIL					(0x1u<<26)
#define	FDCAN_ILS_BOL					(0x1u<<25)
#define	FDCAN_ILS_EWL					(0x1u<<24)
#define	FDCAN_ILS_EPL					(0x1u<<23)
#define	FDCAN_ILS_ELOL					(0x1u<<22)
#define	FDCAN_ILS_DRXL					(0x1u<<19)
#define	FDCAN_ILS_TOOL					(0x1u<<18)
#define	FDCAN_ILS_MRAFL					(0x1u<<17)
#define	FDCAN_ILS_TSWL					(0x1u<<16)
#define	FDCAN_ILS_TEFLL					(0x1u<<15)
#define	FDCAN_ILS_TEFFL					(0x1u<<14)
#define	FDCAN_ILS_TEFWL					(0x1u<<13)
#define	FDCAN_ILS_TEFNL					(0x1u<<12)
#define	FDCAN_ILS_TFEL					(0x1u<<11)
#define	FDCAN_ILS_TCFL					(0x1u<<10)
#define	FDCAN_ILS_TCL					(0x1u<<9)
#define	FDCAN_ILS_HPML					(0x1u<<8)
#define	FDCAN_ILS_RF1LL					(0x1u<<7)
#define	FDCAN_ILS_RF1FL					(0x1u<<6)
#define	FDCAN_ILS_RF1WL					(0x1u<<5)
#define	FDCAN_ILS_RF1NL					(0x1u<<4)
#define	FDCAN_ILS_RF0LL					(0x1u<<3)
#define	FDCAN_ILS_RF0FL					(0x1u<<2)
#define	FDCAN_ILS_RF0WL					(0x1u<<1)
#define	FDCAN_ILS_RF0NL					(0x1u<<0)

