hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fdcan.h
// ILE Configuration

#define	FDCAN_ILE_EINT1					(0x1u<<1)
#define	FDCAN_ILE_EINT0					(0x1u<<0)

#define	FDCAN_ILE_EINT1_B_0X0			(0x0u<<1)
#define	FDCAN_ILE_EINT1_B_0X1			(0x1u<<1)
#define	FDCAN_ILE_EINT0_B_0X0			(0x0u<<0)
#define	FDCAN_ILE_EINT0_B_0X1			(0x1u<<0)

// GFC Configuration

#define	FDCAN_GFC_ANFS					(0x3u<<4)
#define	FDCAN_GFC_ANFS_0				(0x1u<<4)
#define	FDCAN_GFC_ANFE					(0x3u<<2)
#define	FDCAN_GFC_ANFE_0				(0x1u<<2)
#define	FDCAN_GFC_RRFS					(0x1u<<1)
#define	FDCAN_GFC_RRFE					(0x1u<<0)

#define	FDCAN_GFC_ANFS_B_0X0			(0x0u<<4)
#define	FDCAN_GFC_ANFS_B_0X1			(0x1u<<4)
#define	FDCAN_GFC_ANFS_B_0X2			(0x2u<<4)
#define	FDCAN_GFC_ANFS_B_0X3			(0x3u<<4)
#define	FDCAN_GFC_ANFE_B_0X0			(0x0u<<2)
#define	FDCAN_GFC_ANFE_B_0X1			(0x1u<<2)
#define	FDCAN_GFC_ANFE_B_0X2			(0x2u<<2)
#define	FDCAN_GFC_ANFE_B_0X3			(0x3u<<2)
#define	FDCAN_GFC_RRFS_B_0X0			(0x0u<<1)
#define	FDCAN_GFC_RRFS_B_0X1			(0x1u<<1)
#define	FDCAN_GFC_RRFE_B_0X0			(0x0u<<0)
#define	FDCAN_GFC_RRFE_B_0X1			(0x1u<<0)

// SIDFC Configuration

#define	FDCAN_SIDFC_LSS					(0xFFu<<16)
#define	FDCAN_SIDFC_LSS_0				(0x1u<<16)
#define	FDCAN_SIDFC_FLSSA				(0x3FFFu<<2)
#define	FDCAN_SIDFC_FLSSA_0				(0x1u<<2)

#define	FDCAN_SIDFC_LSS_B_0X0			(0x0u<<16)

// XIDFC Configuration

#define	FDCAN_XIDFC_LSE					(0xFFu<<16)
#define	FDCAN_XIDFC_LSE_0				(0x1u<<16)
#define	FDCAN_XIDFC_FLESA				(0x3FFFu<<2)
#define	FDCAN_XIDFC_FLESA_0				(0x1u<<2)

#define	FDCAN_XIDFC_LSE_B_0X0			(0x0u<<16)

// XIDAM Configuration

#define	FDCAN_XIDAM_EIDM				(0x1FFFFFFFu<<0)
#define	FDCAN_XIDAM_EIDM_0				(0x1u<<0)

// HPMS Configuration

#define	FDCAN_HPMS_FLST					(0x1u<<15)
#define	FDCAN_HPMS_FIDX					(0x7Fu<<8)
#define	FDCAN_HPMS_FIDX_0				(0x1u<<8)
#define	FDCAN_HPMS_MSI					(0x3u<<6)
#define	FDCAN_HPMS_MSI_0				(0x1u<<6)
#define	FDCAN_HPMS_BIDX					(0x3Fu<<0)
#define	FDCAN_HPMS_BIDX_0				(0x1u<<0)

#define	FDCAN_HPMS_FLST_B_0X0			(0x0u<<15)
#define	FDCAN_HPMS_FLST_B_0X1			(0x1u<<15)
#define	FDCAN_HPMS_MSI_B_0X0			(0x0u<<6)
#define	FDCAN_HPMS_MSI_B_0X1			(0x1u<<6)
#define	FDCAN_HPMS_MSI_B_0X2			(0x2u<<6)
#define	FDCAN_HPMS_MSI_B_0X3			(0x3u<<6)

// NDAT1 Configuration

#define	FDCAN_NDAT1_ND31				(0x1u<<31)
#define	FDCAN_NDAT1_ND30				(0x1u<<30)
#define	FDCAN_NDAT1_ND29				(0x1u<<29)
#define	FDCAN_NDAT1_ND28				(0x1u<<28)
#define	FDCAN_NDAT1_ND27				(0x1u<<27)
#define	FDCAN_NDAT1_ND26				(0x1u<<26)
#define	FDCAN_NDAT1_ND25				(0x1u<<25)
#define	FDCAN_NDAT1_ND24				(0x1u<<24)
#define	FDCAN_NDAT1_ND23				(0x1u<<23)
#define	FDCAN_NDAT1_ND22				(0x1u<<22)
#define	FDCAN_NDAT1_ND21				(0x1u<<21)
#define	FDCAN_NDAT1_ND20				(0x1u<<20)
#define	FDCAN_NDAT1_ND19				(0x1u<<19)
#define	FDCAN_NDAT1_ND18				(0x1u<<18)
#define	FDCAN_NDAT1_ND17				(0x1u<<17)
#define	FDCAN_NDAT1_ND16				(0x1u<<16)
#define	FDCAN_NDAT1_ND15				(0x1u<<15)
#define	FDCAN_NDAT1_ND14				(0x1u<<14)
#define	FDCAN_NDAT1_ND13				(0x1u<<13)
#define	FDCAN_NDAT1_ND12				(0x1u<<12)
#define	FDCAN_NDAT1_ND11				(0x1u<<11)
#define	FDCAN_NDAT1_ND10				(0x1u<<10)
#define	FDCAN_NDAT1_ND9					(0x1u<<9)
#define	FDCAN_NDAT1_ND8					(0x1u<<8)
#define	FDCAN_NDAT1_ND7					(0x1u<<7)
#define	FDCAN_NDAT1_ND6					(0x1u<<6)
#define	FDCAN_NDAT1_ND5					(0x1u<<5)
#define	FDCAN_NDAT1_ND4					(0x1u<<4)
#define	FDCAN_NDAT1_ND3					(0x1u<<3)
#define	FDCAN_NDAT1_ND2					(0x1u<<2)
#define	FDCAN_NDAT1_ND1					(0x1u<<1)
#define	FDCAN_NDAT1_ND0					(0x1u<<0)

#define	FDCAN_NDAT1_ND31_B_0X0			(0x0u<<31)
#define	FDCAN_NDAT1_ND31_B_0X1			(0x1u<<31)
#define	FDCAN_NDAT1_ND30_B_0X0			(0x0u<<30)
#define	FDCAN_NDAT1_ND30_B_0X1			(0x1u<<30)
#define	FDCAN_NDAT1_ND29_B_0X0			(0x0u<<29)
#define	FDCAN_NDAT1_ND29_B_0X1			(0x1u<<29)
#define	FDCAN_NDAT1_ND28_B_0X0			(0x0u<<28)
#define	FDCAN_NDAT1_ND28_B_0X1			(0x1u<<28)
#define	FDCAN_NDAT1_ND27_B_0X0			(0x0u<<27)
#define	FDCAN_NDAT1_ND27_B_0X1			(0x1u<<27)
#define	FDCAN_NDAT1_ND26_B_0X0			(0x0u<<26)
#define	FDCAN_NDAT1_ND26_B_0X1			(0x1u<<26)
#define	FDCAN_NDAT1_ND25_B_0X0			(0x0u<<25)
#define	FDCAN_NDAT1_ND25_B_0X1			(0x1u<<25)
#define	FDCAN_NDAT1_ND24_B_0X0			(0x0u<<24)
#define	FDCAN_NDAT1_ND24_B_0X1			(0x1u<<24)
#define	FDCAN_NDAT1_ND23_B_0X0			(0x0u<<23)
#define	FDCAN_NDAT1_ND23_B_0X1			(0x1u<<23)
#define	FDCAN_NDAT1_ND22_B_0X0			(0x0u<<22)
#define	FDCAN_NDAT1_ND22_B_0X1			(0x1u<<22)
#define	FDCAN_NDAT1_ND21_B_0X0			(0x0u<<21)
#define	FDCAN_NDAT1_ND21_B_0X1			(0x1u<<21)
#define	FDCAN_NDAT1_ND20_B_0X0			(0x0u<<20)
#define	FDCAN_NDAT1_ND20_B_0X1			(0x1u<<20)
#define	FDCAN_NDAT1_ND19_B_0X0			(0x0u<<19)
#define	FDCAN_NDAT1_ND19_B_0X1			(0x1u<<19)
#define	FDCAN_NDAT1_ND18_B_0X0			(0x0u<<18)
#define	FDCAN_NDAT1_ND18_B_0X1			(0x1u<<18)
#define	FDCAN_NDAT1_ND17_B_0X0			(0x0u<<17)
#define	FDCAN_NDAT1_ND17_B_0X1			(0x1u<<17)
#define	FDCAN_NDAT1_ND16_B_0X0			(0x0u<<16)
#define	FDCAN_NDAT1_ND16_B_0X1			(0x1u<<16)
#define	FDCAN_NDAT1_ND15_B_0X0			(0x0u<<15)
#define	FDCAN_NDAT1_ND15_B_0X1			(0x1u<<15)
#define	FDCAN_NDAT1_ND14_B_0X0			(0x0u<<14)
#define	FDCAN_NDAT1_ND14_B_0X1			(0x1u<<14)
#define	FDCAN_NDAT1_ND13_B_0X0			(0x0u<<13)
#define	FDCAN_NDAT1_ND13_B_0X1			(0x1u<<13)
#define	FDCAN_NDAT1_ND12_B_0X0			(0x0u<<12)
#define	FDCAN_NDAT1_ND12_B_0X1			(0x1u<<12)
#define	FDCAN_NDAT1_ND11_B_0X0			(0x0u<<11)
#define	FDCAN_NDAT1_ND11_B_0X1			(0x1u<<11)
#define	FDCAN_NDAT1_ND10_B_0X0			(0x0u<<10)
#define	FDCAN_NDAT1_ND10_B_0X1			(0x1u<<10)
#define	FDCAN_NDAT1_ND9_B_0X0			(0x0u<<9)
#define	FDCAN_NDAT1_ND9_B_0X1			(0x1u<<9)
#define	FDCAN_NDAT1_ND8_B_0X0			(0x0u<<8)
#define	FDCAN_NDAT1_ND8_B_0X1			(0x1u<<8)
#define	FDCAN_NDAT1_ND7_B_0X0			(0x0u<<7)
#define	FDCAN_NDAT1_ND7_B_0X1			(0x1u<<7)
#define	FDCAN_NDAT1_ND6_B_0X0			(0x0u<<6)
#define	FDCAN_NDAT1_ND6_B_0X1			(0x1u<<6)
#define	FDCAN_NDAT1_ND5_B_0X0			(0x0u<<5)
#define	FDCAN_NDAT1_ND5_B_0X1			(0x1u<<5)
#define	FDCAN_NDAT1_ND4_B_0X0			(0x0u<<4)
#define	FDCAN_NDAT1_ND4_B_0X1			(0x1u<<4)
#define	FDCAN_NDAT1_ND3_B_0X0			(0x0u<<3)
#define	FDCAN_NDAT1_ND3_B_0X1			(0x1u<<3)
#define	FDCAN_NDAT1_ND2_B_0X0			(0x0u<<2)
#define	FDCAN_NDAT1_ND2_B_0X1			(0x1u<<2)
#define	FDCAN_NDAT1_ND1_B_0X0			(0x0u<<1)
#define	FDCAN_NDAT1_ND1_B_0X1			(0x1u<<1)
#define	FDCAN_NDAT1_ND0_B_0X0			(0x0u<<0)
#define	FDCAN_NDAT1_ND0_B_0X1			(0x1u<<0)

// NDAT2 Configuration

#define	FDCAN_NDAT2_ND63				(0x1u<<31)
#define	FDCAN_NDAT2_ND62				(0x1u<<30)
#define	FDCAN_NDAT2_ND61				(0x1u<<29)
#define	FDCAN_NDAT2_ND60				(0x1u<<28)
#define	FDCAN_NDAT2_ND59				(0x1u<<27)
#define	FDCAN_NDAT2_ND58				(0x1u<<26)
#define	FDCAN_NDAT2_ND57				(0x1u<<25)
#define	FDCAN_NDAT2_ND56				(0x1u<<24)
#define	FDCAN_NDAT2_ND55				(0x1u<<23)
#define	FDCAN_NDAT2_ND54				(0x1u<<22)
#define	FDCAN_NDAT2_ND53				(0x1u<<21)
#define	FDCAN_NDAT2_ND52				(0x1u<<20)
#define	FDCAN_NDAT2_ND51				(0x1u<<19)
#define	FDCAN_NDAT2_ND50				(0x1u<<18)
#define	FDCAN_NDAT2_ND49				(0x1u<<17)
#define	FDCAN_NDAT2_ND48				(0x1u<<16)
#define	FDCAN_NDAT2_ND47				(0x1u<<15)
#define	FDCAN_NDAT2_ND46				(0x1u<<14)
#define	FDCAN_NDAT2_ND45				(0x1u<<13)
#define	FDCAN_NDAT2_ND44				(0x1u<<12)
#define	FDCAN_NDAT2_ND43				(0x1u<<11)
#define	FDCAN_NDAT2_ND42				(0x1u<<10)
#define	FDCAN_NDAT2_ND41				(0x1u<<9)
#define	FDCAN_NDAT2_ND40				(0x1u<<8)
#define	FDCAN_NDAT2_ND39				(0x1u<<7)
#define	FDCAN_NDAT2_ND38				(0x1u<<6)
#define	FDCAN_NDAT2_ND37				(0x1u<<5)
#define	FDCAN_NDAT2_ND36				(0x1u<<4)
#define	FDCAN_NDAT2_ND35				(0x1u<<3)
#define	FDCAN_NDAT2_ND34				(0x1u<<2)
#define	FDCAN_NDAT2_ND33				(0x1u<<1)
#define	FDCAN_NDAT2_ND32				(0x1u<<0)

#define	FDCAN_NDAT2_ND63_B_0X0			(0x0u<<31)
#define	FDCAN_NDAT2_ND63_B_0X1			(0x1u<<31)
#define	FDCAN_NDAT2_ND62_B_0X0			(0x0u<<30)
#define	FDCAN_NDAT2_ND62_B_0X1			(0x1u<<30)
#define	FDCAN_NDAT2_ND61_B_0X0			(0x0u<<29)
#define	FDCAN_NDAT2_ND61_B_0X1			(0x1u<<29)
#define	FDCAN_NDAT2_ND60_B_0X0			(0x0u<<28)
#define	FDCAN_NDAT2_ND60_B_0X1			(0x1u<<28)
#define	FDCAN_NDAT2_ND59_B_0X0			(0x0u<<27)
#define	FDCAN_NDAT2_ND59_B_0X1			(0x1u<<27)
#define	FDCAN_NDAT2_ND58_B_0X0			(0x0u<<26)
#define	FDCAN_NDAT2_ND58_B_0X1			(0x1u<<26)
#define	FDCAN_NDAT2_ND57_B_0X0			(0x0u<<25)
#define	FDCAN_NDAT2_ND57_B_0X1			(0x1u<<25)
#define	FDCAN_NDAT2_ND56_B_0X0			(0x0u<<24)
#define	FDCAN_NDAT2_ND56_B_0X1			(0x1u<<24)
#define	FDCAN_NDAT2_ND55_B_0X0			(0x0u<<23)
#define	FDCAN_NDAT2_ND55_B_0X1			(0x1u<<23)
#define	FDCAN_NDAT2_ND54_B_0X0			(0x0u<<22)
#define	FDCAN_NDAT2_ND54_B_0X1			(0x1u<<22)
#define	FDCAN_NDAT2_ND53_B_0X0			(0x0u<<21)
#define	FDCAN_NDAT2_ND53_B_0X1			(0x1u<<21)
#define	FDCAN_NDAT2_ND52_B_0X0			(0x0u<<20)
#define	FDCAN_NDAT2_ND52_B_0X1			(0x1u<<20)
#define	FDCAN_NDAT2_ND51_B_0X0			(0x0u<<19)
#define	FDCAN_NDAT2_ND51_B_0X1			(0x1u<<19)
#define	FDCAN_NDAT2_ND50_B_0X0			(0x0u<<18)
#define	FDCAN_NDAT2_ND50_B_0X1			(0x1u<<18)
#define	FDCAN_NDAT2_ND49_B_0X0			(0x0u<<17)
#define	FDCAN_NDAT2_ND49_B_0X1			(0x1u<<17)
#define	FDCAN_NDAT2_ND48_B_0X0			(0x0u<<16)
#define	FDCAN_NDAT2_ND48_B_0X1			(0x1u<<16)
#define	FDCAN_NDAT2_ND47_B_0X0			(0x0u<<15)
#define	FDCAN_NDAT2_ND47_B_0X1			(0x1u<<15)
#define	FDCAN_NDAT2_ND46_B_0X0			(0x0u<<14)
#define	FDCAN_NDAT2_ND46_B_0X1			(0x1u<<14)
#define	FDCAN_NDAT2_ND45_B_0X0			(0x0u<<13)
#define	FDCAN_NDAT2_ND45_B_0X1			(0x1u<<13)
#define	FDCAN_NDAT2_ND44_B_0X0			(0x0u<<12)
#define	FDCAN_NDAT2_ND44_B_0X1			(0x1u<<12)
#define	FDCAN_NDAT2_ND43_B_0X0			(0x0u<<11)
#define	FDCAN_NDAT2_ND43_B_0X1			(0x1u<<11)
#define	FDCAN_NDAT2_ND42_B_0X0			(0x0u<<10)
#define	FDCAN_NDAT2_ND42_B_0X1			(0x1u<<10)
#define	FDCAN_NDAT2_ND41_B_0X0			(0x0u<<9)
#define	FDCAN_NDAT2_ND41_B_0X1			(0x1u<<9)
#define	FDCAN_NDAT2_ND40_B_0X0			(0x0u<<8)
#define	FDCAN_NDAT2_ND40_B_0X1			(0x1u<<8)
#define	FDCAN_NDAT2_ND39_B_0X0			(0x0u<<7)
#define	FDCAN_NDAT2_ND39_B_0X1			(0x1u<<7)
#define	FDCAN_NDAT2_ND38_B_0X0			(0x0u<<6)
#define	FDCAN_NDAT2_ND38_B_0X1			(0x1u<<6)
#define	FDCAN_NDAT2_ND37_B_0X0			(0x0u<<5)
#define	FDCAN_NDAT2_ND37_B_0X1			(0x1u<<5)
#define	FDCAN_NDAT2_ND36_B_0X0			(0x0u<<4)
#define	FDCAN_NDAT2_ND36_B_0X1			(0x1u<<4)
#define	FDCAN_NDAT2_ND35_B_0X0			(0x0u<<3)
#define	FDCAN_NDAT2_ND35_B_0X1			(0x1u<<3)
#define	FDCAN_NDAT2_ND34_B_0X0			(0x0u<<2)
#define	FDCAN_NDAT2_ND34_B_0X1			(0x1u<<2)
#define	FDCAN_NDAT2_ND33_B_0X0			(0x0u<<1)
#define	FDCAN_NDAT2_ND33_B_0X1			(0x1u<<1)
#define	FDCAN_NDAT2_ND32_B_0X0			(0x0u<<0)
#define	FDCAN_NDAT2_ND32_B_0X1			(0x1u<<0)

// RXF0C Configuration

#define	FDCAN_RXF0C_F0OM				(0x1u<<31)
#define	FDCAN_RXF0C_F0WM				(0x7Fu<<24)
#define	FDCAN_RXF0C_F0WM_0				(0x1u<<24)
#define	FDCAN_RXF0C_F0S					(0x7Fu<<16)
#define	FDCAN_RXF0C_F0S_0				(0x1u<<16)
#define	FDCAN_RXF0C_F0SA				(0x3FFFu<<2)
#define	FDCAN_RXF0C_F0SA_0				(0x1u<<2)

#define	FDCAN_RXF0C_F0OM_B_0X0			(0x0u<<31)
#define	FDCAN_RXF0C_F0OM_B_0X1			(0x1u<<31)
#define	FDCAN_RXF0C_F0WM_B_0X0			(0x0u<<24)
#define	FDCAN_RXF0C_F0S_B_0X0			(0x0u<<16)

// RXF0S Configuration

#define	FDCAN_RXF0S_RF0L				(0x1u<<25)
#define	FDCAN_RXF0S_F0F					(0x1u<<24)
#define	FDCAN_RXF0S_F0PI				(0x3Fu<<16)
#define	FDCAN_RXF0S_F0PI_0				(0x1u<<16)
#define	FDCAN_RXF0S_F0GI				(0x3Fu<<8)
#define	FDCAN_RXF0S_F0GI_0				(0x1u<<8)
#define	FDCAN_RXF0S_F0FL				(0x7Fu<<0)
#define	FDCAN_RXF0S_F0FL_0				(0x1u<<0)

#define	FDCAN_RXF0S_RF0L_B_0X0			(0x0u<<25)
#define	FDCAN_RXF0S_RF0L_B_0X1			(0x1u<<25)
#define	FDCAN_RXF0S_F0F_B_0X0			(0x0u<<24)
#define	FDCAN_RXF0S_F0F_B_0X1			(0x1u<<24)

// RXF0A Configuration

#define	FDCAN_RXF0A_F0AI				(0x3Fu<<0)
#define	FDCAN_RXF0A_F0AI_0				(0x1u<<0)

// RXBC Configuration

#define	FDCAN_RXBC_RBSA					(0x3FFFu<<2)
#define	FDCAN_RXBC_RBSA_0				(0x1u<<2)

// RXF1C Configuration

