hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_fdcan.h
// TTILS Configuration

#define	FDCAN_TTILS_CERL				(0x1u<<18)
#define	FDCAN_TTILS_AWL					(0x1u<<17)
#define	FDCAN_TTILS_WTL					(0x1u<<16)
#define	FDCAN_TTILS_IWTL				(0x1u<<15)
#define	FDCAN_TTILS_ELCL				(0x1u<<14)
#define	FDCAN_TTILS_SE2L				(0x1u<<13)
#define	FDCAN_TTILS_SE1L				(0x1u<<12)
#define	FDCAN_TTILS_TXOL				(0x1u<<11)
#define	FDCAN_TTILS_TXUL				(0x1u<<10)
#define	FDCAN_TTILS_GTEL				(0x1u<<9)
#define	FDCAN_TTILS_GTDL				(0x1u<<8)
#define	FDCAN_TTILS_GTWL				(0x1u<<7)
#define	FDCAN_TTILS_SWEL				(0x1u<<6)
#define	FDCAN_TTILS_TTMIL				(0x1u<<5)
#define	FDCAN_TTILS_RTMIL				(0x1u<<4)
#define	FDCAN_TTILS_SOGL				(0x1u<<3)
#define	FDCAN_TTILS_CSML				(0x1u<<2)
#define	FDCAN_TTILS_SMCL				(0x1u<<1)
#define	FDCAN_TTILS_SBCL				(0x1u<<0)

#define	FDCAN_TTILS_CERL_B_0X0			(0x0u<<18)
#define	FDCAN_TTILS_CERL_B_0X1			(0x1u<<18)
#define	FDCAN_TTILS_AWL_B_0X0			(0x0u<<17)
#define	FDCAN_TTILS_AWL_B_0X1			(0x1u<<17)
#define	FDCAN_TTILS_WTL_B_0X0			(0x0u<<16)
#define	FDCAN_TTILS_WTL_B_0X1			(0x1u<<16)
#define	FDCAN_TTILS_IWTL_B_0X0			(0x0u<<15)
#define	FDCAN_TTILS_IWTL_B_0X1			(0x1u<<15)
#define	FDCAN_TTILS_ELCL_B_0X0			(0x0u<<14)
#define	FDCAN_TTILS_ELCL_B_0X1			(0x1u<<14)
#define	FDCAN_TTILS_SE2L_B_0X0			(0x0u<<13)
#define	FDCAN_TTILS_SE2L_B_0X1			(0x1u<<13)
#define	FDCAN_TTILS_SE1L_B_0X0			(0x0u<<12)
#define	FDCAN_TTILS_SE1L_B_0X1			(0x1u<<12)
#define	FDCAN_TTILS_TXOL_B_0X0			(0x0u<<11)
#define	FDCAN_TTILS_TXOL_B_0X1			(0x1u<<11)
#define	FDCAN_TTILS_TXUL_B_0X0			(0x0u<<10)
#define	FDCAN_TTILS_TXUL_B_0X1			(0x1u<<10)
#define	FDCAN_TTILS_GTEL_B_0X0			(0x0u<<9)
#define	FDCAN_TTILS_GTEL_B_0X1			(0x1u<<9)
#define	FDCAN_TTILS_GTDL_B_0X0			(0x0u<<8)
#define	FDCAN_TTILS_GTDL_B_0X1			(0x1u<<8)
#define	FDCAN_TTILS_GTWL_B_0X0			(0x0u<<7)
#define	FDCAN_TTILS_GTWL_B_0X1			(0x1u<<7)
#define	FDCAN_TTILS_SWEL_B_0X0			(0x0u<<6)
#define	FDCAN_TTILS_SWEL_B_0X1			(0x1u<<6)
#define	FDCAN_TTILS_TTMIL_B_0X0			(0x0u<<5)
#define	FDCAN_TTILS_TTMIL_B_0X1			(0x1u<<5)
#define	FDCAN_TTILS_RTMIL_B_0X0			(0x0u<<4)
#define	FDCAN_TTILS_RTMIL_B_0X1			(0x1u<<4)
#define	FDCAN_TTILS_SOGL_B_0X0			(0x0u<<3)
#define	FDCAN_TTILS_SOGL_B_0X1			(0x1u<<3)
#define	FDCAN_TTILS_CSML_B_0X0			(0x0u<<2)
#define	FDCAN_TTILS_CSML_B_0X1			(0x1u<<2)
#define	FDCAN_TTILS_SMCL_B_0X0			(0x0u<<1)
#define	FDCAN_TTILS_SMCL_B_0X1			(0x1u<<1)
#define	FDCAN_TTILS_SBCL_B_0X0			(0x0u<<0)
#define	FDCAN_TTILS_SBCL_B_0X1			(0x1u<<0)

// TTOST Configuration

#define	FDCAN_TTOST_SPL					(0x1u<<31)
#define	FDCAN_TTOST_WECS				(0x1u<<30)
#define	FDCAN_TTOST_AWE					(0x1u<<29)
#define	FDCAN_TTOST_WFE					(0x1u<<28)
#define	FDCAN_TTOST_GSI					(0x1u<<27)
#define	FDCAN_TTOST_TMP					(0x7u<<24)
#define	FDCAN_TTOST_TMP_0				(0x1u<<24)
#define	FDCAN_TTOST_GFI					(0x1u<<23)
#define	FDCAN_TTOST_WGTD				(0x1u<<22)
#define	FDCAN_TTOST_RTO					(0xFFu<<8)
#define	FDCAN_TTOST_RTO_0				(0x1u<<8)
#define	FDCAN_TTOST_QCS					(0x1u<<7)
#define	FDCAN_TTOST_QGTP				(0x1u<<6)
#define	FDCAN_TTOST_SYS					(0x3u<<4)
#define	FDCAN_TTOST_SYS_0				(0x1u<<4)
#define	FDCAN_TTOST_MS					(0x3u<<2)
#define	FDCAN_TTOST_MS_0				(0x1u<<2)
#define	FDCAN_TTOST_EL					(0x3u<<0)
#define	FDCAN_TTOST_EL_0				(0x1u<<0)

#define	FDCAN_TTOST_SPL_B_0X0			(0x0u<<31)
#define	FDCAN_TTOST_SPL_B_0X1			(0x1u<<31)
#define	FDCAN_TTOST_WECS_B_0X0			(0x0u<<30)
#define	FDCAN_TTOST_WECS_B_0X1			(0x1u<<30)
#define	FDCAN_TTOST_AWE_B_0X0			(0x0u<<29)
#define	FDCAN_TTOST_AWE_B_0X1			(0x1u<<29)
#define	FDCAN_TTOST_WFE_B_0X0			(0x0u<<28)
#define	FDCAN_TTOST_WFE_B_0X1			(0x1u<<28)
#define	FDCAN_TTOST_GSI_B_0X0			(0x0u<<27)
#define	FDCAN_TTOST_GSI_B_0X1			(0x1u<<27)
#define	FDCAN_TTOST_GFI_B_0X0			(0x0u<<23)
#define	FDCAN_TTOST_GFI_B_0X1			(0x1u<<23)
#define	FDCAN_TTOST_WGTD_B_0X0			(0x0u<<22)
#define	FDCAN_TTOST_WGTD_B_0X1			(0x1u<<22)
#define	FDCAN_TTOST_QCS_B_0X0			(0x0u<<7)
#define	FDCAN_TTOST_QCS_B_0X1			(0x1u<<7)
#define	FDCAN_TTOST_QGTP_B_0X0			(0x0u<<6)
#define	FDCAN_TTOST_QGTP_B_0X1			(0x1u<<6)
#define	FDCAN_TTOST_SYS_B_0X0			(0x0u<<4)
#define	FDCAN_TTOST_SYS_B_0X1			(0x1u<<4)
#define	FDCAN_TTOST_SYS_B_0X2			(0x2u<<4)
#define	FDCAN_TTOST_SYS_B_0X3			(0x3u<<4)
#define	FDCAN_TTOST_MS_B_0X0			(0x0u<<2)
#define	FDCAN_TTOST_MS_B_0X1			(0x1u<<2)
#define	FDCAN_TTOST_MS_B_0X2			(0x2u<<2)
#define	FDCAN_TTOST_MS_B_0X3			(0x3u<<2)
#define	FDCAN_TTOST_EL_B_0X0			(0x0u<<0)
#define	FDCAN_TTOST_EL_B_0X1			(0x1u<<0)
#define	FDCAN_TTOST_EL_B_0X2			(0x2u<<0)
#define	FDCAN_TTOST_EL_B_0X3			(0x3u<<0)

// TURNA Configuration

#define	FDCAN_TURNA_NAV					(0x3FFFFu<<0)
#define	FDCAN_TURNA_NAV_0				(0x1u<<0)

#define	FDCAN_TURNA_NAV_B_0X0EFFF		(0xEFFFu<<0)
#define	FDCAN_TURNA_NAV_B_0X21000		(0x21000u<<0)

// TTLGT Configuration

#define	FDCAN_TTLGT_GT					(0xFFFFu<<16)
#define	FDCAN_TTLGT_GT_0				(0x1u<<16)
#define	FDCAN_TTLGT_LT					(0xFFFFu<<0)
#define	FDCAN_TTLGT_LT_0				(0x1u<<0)

// TTCTC Configuration

#define	FDCAN_TTCTC_CC					(0x3Fu<<16)
#define	FDCAN_TTCTC_CC_0				(0x1u<<16)
#define	FDCAN_TTCTC_CT					(0xFFFFu<<0)
#define	FDCAN_TTCTC_CT_0				(0x1u<<0)

// TTCPT Configuration

#define	FDCAN_TTCPT_SWV					(0xFFFFu<<16)
#define	FDCAN_TTCPT_SWV_0				(0x1u<<16)
#define	FDCAN_TTCPT_CCV					(0x3Fu<<0)
#define	FDCAN_TTCPT_CCV_0				(0x1u<<0)

// TTCSM Configuration

#define	FDCAN_TTCSM_CSM					(0xFFFFu<<0)
#define	FDCAN_TTCSM_CSM_0				(0x1u<<0)

// TTTS Configuration

#define	FDCAN_TTTS_EVTSEL				(0x3u<<4)
#define	FDCAN_TTTS_EVTSEL_0				(0x1u<<4)
#define	FDCAN_TTTS_SWTDEL				(0x3u<<0)
#define	FDCAN_TTTS_SWTDEL_0				(0x1u<<0)

#define	FDCAN_TTTS_EVTSEL_B_0X0			(0x0u<<4)
#define	FDCAN_TTTS_EVTSEL_B_0X1			(0x1u<<4)
#define	FDCAN_TTTS_EVTSEL_B_0X2			(0x2u<<4)
#define	FDCAN_TTTS_EVTSEL_B_0X3			(0x3u<<4)
#define	FDCAN_TTTS_SWTDEL_B_0X0			(0x0u<<0)
#define	FDCAN_TTTS_SWTDEL_B_0X1			(0x1u<<0)
#define	FDCAN_TTTS_SWTDEL_B_0X2			(0x2u<<0)
#define	FDCAN_TTTS_SWTDEL_B_0X3			(0x3u<<0)
